javnson/gmp_pro/ctl/suite/mcs_pmsm_nt/project/f280049c/280049C_LaunchPad.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28004x" --part "F28004x_100PZ" --package "F28004x_100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.03.00.00"
 * @v2CliArgs --device "TMS320F280049C" --package "100PZ" --context "system" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.03.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const asysctl        = scripting.addModule("/driverlib/asysctl.js");
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const dac            = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1           = dac.addInstance();
const dac2           = dac.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const epwm3          = epwm.addInstance();
const epwm4          = epwm.addInstance();
const epwm5          = epwm.addInstance();
const epwm6          = epwm.addInstance();
const eqep           = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1          = eqep.addInstance();
const eqep2          = eqep.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const gpio3          = gpio.addInstance();
const gpio4          = gpio.addInstance();
const sci            = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1           = sci.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.adcClockPrescaler              = "ADC_CLK_DIV_2_0";
adc1.soc0Name                       = "J3_IW";
adc1.soc0IndependentNameMode        = true;
adc1.soc0SampleWindow               = 8;
adc1.soc0Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0Channel                    = "ADC_CH_ADCIN9";
adc1.soc1SampleWindow               = 8;
adc1.soc2Name                       = "J7_VU";
adc1.soc2IndependentNameMode        = true;
adc1.soc1IndependentNameMode        = true;
adc1.soc2Channel                    = "ADC_CH_ADCIN2";
adc1.soc2SampleWindow               = 8;
adc1.soc3Name                       = "J3_VDC";
adc1.soc3IndependentNameMode        = true;
adc1.soc3Channel                    = "ADC_CH_ADCIN5";
adc1.soc3SampleWindow               = 8;
adc1.soc4Name                       = "J7_VDC";
adc1.soc4Channel                    = "ADC_CH_ADCIN6";
adc1.soc4SampleWindow               = 8;
adc1.soc1Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc4Trigger                    = "ADC_TRIGGER_EPWM1_SOCA";
adc1.$name                          = "IRIS_ADCA";
adc1.enabledInts                    = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1               = true;
adc1.enableInterrupt1ContinuousMode = true;
adc1.registerInterrupts             = ["1"];
adc1.soc4IndependentNameMode        = true;
adc1.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc1Name                       = "J3_VDC";
adc1.soc1Channel                    = "ADC_CH_ADCIN5";
adc1.adcInt1.enableInterrupt        = true;
adc1.adcInt1.interruptHandler       = "MainISR";

adc2.adcBase                 = "ADCB_BASE";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc2.soc0Name                = "J3_IU";
adc2.soc0Channel             = "ADC_CH_ADCIN2";
adc2.soc0SampleWindow        = 8;
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1IndependentNameMode = true;
adc2.soc0IndependentNameMode = true;
adc2.soc1SampleWindow        = 8;
adc2.soc1Channel             = "ADC_CH_ADCIN1";
adc2.soc2Name                = "J3_VU";
adc2.soc2IndependentNameMode = true;
adc2.soc2SampleWindow        = 8;
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.$name                   = "IRIS_ADCB";
adc2.soc1Name                = "J3_VW";

adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc3.soc0Name                = "J3_IV";
adc3.soc0IndependentNameMode = true;
adc3.soc0SampleWindow        = 8;
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1IndependentNameMode = true;
adc3.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc1SampleWindow        = 8;
adc3.soc2Name                = "J7_IU";
adc3.soc2Channel             = "ADC_CH_ADCIN3";
adc3.soc2IndependentNameMode = true;
adc3.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc2SampleWindow        = 8;
adc3.soc3IndependentNameMode = true;
adc3.soc3Channel             = "ADC_CH_ADCIN1";
adc3.soc3Name                = "J7_VW";
adc3.soc3Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc3SampleWindow        = 8;
adc3.soc4Name                = "J7_VV";
adc3.soc4IndependentNameMode = true;
adc3.soc4Channel             = "ADC_CH_ADCIN14";
adc3.soc4Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.soc4SampleWindow        = 8;
adc3.soc5Name                = "J3_VV";
adc3.soc5IndependentNameMode = true;
adc3.soc5Channel             = "ADC_CH_ADCIN2";
adc3.soc5SampleWindow        = 8;
adc3.soc5Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc3.$name                   = "IRIS_ADCC";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc1Name                = "J3_VV";
adc3.soc1Channel             = "ADC_CH_ADCIN2";

asysctl.analogReference = "INTERNAL";

